#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.analytics-bucket-metascore.google_storage_bucket.bucket: Refreshing state... [id=de-challengue-test-metascore-analytics]
module.raw-bucket-metascore.google_storage_bucket.bucket: Refreshing state... [id=de-challengue-test-metascore-raw]
module.analytics_dataset["consumption"].google_bigquery_dataset.main: Refreshing state... [id=projects/de-challengue-test/datasets/consumption]
google_pubsub_topic.ldn_arrive_topic: Refreshing state... [id=projects/de-challengue-test/topics/metascore-lnd-notification]
module.analytics_dataset["staging"].google_bigquery_dataset.main: Refreshing state... [id=projects/de-challengue-test/datasets/staging]
google_project_service.cloudresourcemanager: Refreshing state... [id=de-challengue-test/cloudresourcemanager.googleapis.com]
module.landing-bucket-metascore.google_storage_bucket.bucket: Refreshing state... [id=de-challengue-test-metascore-lnd]
module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Mariano.Gonzalez0@walmart.com"]: Refreshing state... [id=b/de-challengue-test-metascore-analytics/roles/storage.objectAdmin/user:mariano.gonzalez0@walmart.com]
module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"]: Refreshing state... [id=b/de-challengue-test-metascore-analytics/roles/storage.objectAdmin/user:zahidale.zg@gmail.com]
module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"]: Refreshing state... [id=b/de-challengue-test-metascore-analytics/roles/storage.objectViewer/user:zahid.galea@wom.cl]
module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Gustavo.Aguilar0@walmart.com"]: Refreshing state... [id=b/de-challengue-test-metascore-analytics/roles/storage.objectAdmin/user:gustavo.aguilar0@walmart.com]
module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Mariano.Gonzalez0@walmart.com"]: Refreshing state... [id=b/de-challengue-test-metascore-raw/roles/storage.objectAdmin/user:mariano.gonzalez0@walmart.com]
module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Gustavo.Aguilar0@walmart.com"]: Refreshing state... [id=b/de-challengue-test-metascore-raw/roles/storage.objectAdmin/user:gustavo.aguilar0@walmart.com]
module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"]: Refreshing state... [id=b/de-challengue-test-metascore-raw/roles/storage.objectAdmin/user:zahidale.zg@gmail.com]
module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"]: Refreshing state... [id=b/de-challengue-test-metascore-raw/roles/storage.objectViewer/user:zahid.galea@wom.cl]
module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Mariano.Gonzalez0@walmart.com"]: Refreshing state... [id=b/de-challengue-test-metascore-lnd/roles/storage.objectAdmin/user:mariano.gonzalez0@walmart.com]
module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"]: Refreshing state... [id=b/de-challengue-test-metascore-lnd/roles/storage.objectAdmin/user:zahidale.zg@gmail.com]
module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Gustavo.Aguilar0@walmart.com"]: Refreshing state... [id=b/de-challengue-test-metascore-lnd/roles/storage.objectAdmin/user:gustavo.aguilar0@walmart.com]
module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"]: Refreshing state... [id=b/de-challengue-test-metascore-lnd/roles/storage.objectViewer/user:zahid.galea@wom.cl]
google_pubsub_topic_iam_binding.ldn_arrive_binding: Refreshing state... [id=projects/de-challengue-test/topics/metascore-lnd-notification/roles/pubsub.publisher]
module.analytics_dataset_data_editor["staging"].google_bigquery_dataset_iam_member.dataset_iam["user:Gustavo.Aguilar0@walmart.com"]: Refreshing state... [id=projects/de-challengue-test/datasets/staging/roles/bigquery.dataEditor/user:gustavo.aguilar0@walmart.com]
module.analytics_dataset_data_editor["staging"].google_bigquery_dataset_iam_member.dataset_iam["user:Mariano.Gonzalez0@walmart.com"]: Refreshing state... [id=projects/de-challengue-test/datasets/staging/roles/bigquery.dataEditor/user:mariano.gonzalez0@walmart.com]
module.analytics_dataset_data_editor["consumption"].google_bigquery_dataset_iam_member.dataset_iam["user:Mariano.Gonzalez0@walmart.com"]: Refreshing state... [id=projects/de-challengue-test/datasets/consumption/roles/bigquery.dataEditor/user:mariano.gonzalez0@walmart.com]
module.analytics_dataset_data_editor["consumption"].google_bigquery_dataset_iam_member.dataset_iam["user:Gustavo.Aguilar0@walmart.com"]: Refreshing state... [id=projects/de-challengue-test/datasets/consumption/roles/bigquery.dataEditor/user:gustavo.aguilar0@walmart.com]
module.analytics_dataset_data_viewer["consumption"].google_bigquery_dataset_iam_member.dataset_iam["user:zahid.galea@wom.cl"]: Refreshing state... [id=projects/de-challengue-test/datasets/consumption/roles/bigquery.dataViewer/user:zahid.galea@wom.cl]
module.analytics_dataset_data_owner["consumption"].google_bigquery_dataset_iam_member.dataset_iam["user:zahidale.zg@gmail.com"]: Refreshing state... [id=projects/de-challengue-test/datasets/consumption/roles/bigquery.dataOwner/user:zahidale.zg@gmail.com]
module.analytics_dataset_data_owner["staging"].google_bigquery_dataset_iam_member.dataset_iam["user:zahidale.zg@gmail.com"]: Refreshing state... [id=projects/de-challengue-test/datasets/staging/roles/bigquery.dataOwner/user:zahidale.zg@gmail.com]
module.analytics_dataset_data_viewer["staging"].google_bigquery_dataset_iam_member.dataset_iam["user:zahid.galea@wom.cl"]: Refreshing state... [id=projects/de-challengue-test/datasets/staging/roles/bigquery.dataViewer/user:zahid.galea@wom.cl]
google_storage_notification.object_landing_notification: Refreshing state... [id=de-challengue-test-metascore-lnd/notificationConfigs/5]
google_project_service.project["storage-component.googleapis.com"]: Refreshing state... [id=de-challengue-test/storage-component.googleapis.com]
google_project_service.project["cloudfunctions.googleapis.com"]: Refreshing state... [id=de-challengue-test/cloudfunctions.googleapis.com]
google_project_service.project["dataflow.googleapis.com"]: Refreshing state... [id=de-challengue-test/dataflow.googleapis.com]
google_project_service.project["appengine.googleapis.com"]: Refreshing state... [id=de-challengue-test/appengine.googleapis.com]
google_project_service.project["cloudbuild.googleapis.com"]: Refreshing state... [id=de-challengue-test/cloudbuild.googleapis.com]
google_project_service.project["container.googleapis.com"]: Refreshing state... [id=de-challengue-test/container.googleapis.com]
google_project_service.project["iam.googleapis.com"]: Refreshing state... [id=de-challengue-test/iam.googleapis.com]
google_project_service.project["bigquery.googleapis.com"]: Refreshing state... [id=de-challengue-test/bigquery.googleapis.com]
google_project_service.project["compute.googleapis.com"]: Refreshing state... [id=de-challengue-test/compute.googleapis.com]
google_project_service.project["iamcredentials.googleapis.com"]: Refreshing state... [id=de-challengue-test/iamcredentials.googleapis.com]
google_project_service.project["datastudio.googleapis.com"]: Refreshing state... [id=de-challengue-test/datastudio.googleapis.com]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_pubsub_topic.ldn_arrive_topic has changed
  ~ resource "google_pubsub_topic" "ldn_arrive_topic" {
        id      = "projects/de-challengue-test/topics/metascore-lnd-notification"
      + labels  = {}
        name    = "metascore-lnd-notification"
        # (1 unchanged attribute hidden)
    }

  # google_storage_notification.object_landing_notification has changed
  ~ resource "google_storage_notification" "object_landing_notification" {
      + custom_attributes = {}
        id                = "de-challengue-test-metascore-lnd/notificationConfigs/5"
        # (6 unchanged attributes hidden)
    }

  # module.analytics-bucket-metascore.google_storage_bucket.bucket has changed
  ~ resource "google_storage_bucket" "bucket" {
        id                          = "de-challengue-test-metascore-analytics"
      + labels                      = {}
        name                        = "de-challengue-test-metascore-analytics"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Mariano.Gonzalez0@walmart.com"] has changed
  ~ resource "google_storage_bucket_iam_member" "members" {
      ~ etag   = "CAI=" -> "CAU="
        id     = "b/de-challengue-test-metascore-analytics/roles/storage.objectAdmin/user:mariano.gonzalez0@walmart.com"
        # (3 unchanged attributes hidden)
    }

  # module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"] has changed
  ~ resource "google_storage_bucket_iam_member" "members" {
      ~ etag   = "CAM=" -> "CAU="
        id     = "b/de-challengue-test-metascore-analytics/roles/storage.objectViewer/user:zahid.galea@wom.cl"
        # (3 unchanged attributes hidden)
    }

  # module.analytics_dataset["consumption"].google_bigquery_dataset.main has changed
  ~ resource "google_bigquery_dataset" "main" {
      ~ etag                            = "Sw52oIMpOLTg0FFN/0noOA==" -> "Y2vMwnhquNUZ9W4sO3fYew=="
        id                              = "projects/de-challengue-test/datasets/consumption"
      + labels                          = {}
      ~ last_modified_time              = 1640717228139 -> 1640717242613
        # (8 unchanged attributes hidden)

      + access {
          + role          = "OWNER"
          + user_by_email = "zahidale.ZG@gmail.com"
        }
      + access {
          + role          = "READER"
          + user_by_email = "zahid.galea@wom.cl"
        }
      + access {
          + role          = "WRITER"
          + user_by_email = "gustavo.aguilar0@walmart.com"
        }
      + access {
          + role          = "WRITER"
          + user_by_email = "mariano.gonzalez0@walmart.com"
        }
        # (4 unchanged blocks hidden)
    }

  # module.analytics_dataset["staging"].google_bigquery_dataset.main has changed
  ~ resource "google_bigquery_dataset" "main" {
      ~ etag                            = "1gRZQYQdpdRe7Fkf3TNMBg==" -> "UGHuOHMxKcCNpjZQQwdzLg=="
        id                              = "projects/de-challengue-test/datasets/staging"
      + labels                          = {}
      ~ last_modified_time              = 1640717228137 -> 1640717242537
        # (8 unchanged attributes hidden)

      + access {
          + role          = "OWNER"
          + user_by_email = "zahidale.ZG@gmail.com"
        }
      + access {
          + role          = "READER"
          + user_by_email = "zahid.galea@wom.cl"
        }
      + access {
          + role          = "WRITER"
          + user_by_email = "gustavo.aguilar0@walmart.com"
        }
      + access {
          + role          = "WRITER"
          + user_by_email = "mariano.gonzalez0@walmart.com"
        }
        # (4 unchanged blocks hidden)
    }

  # module.landing-bucket-metascore.google_storage_bucket.bucket has changed
  ~ resource "google_storage_bucket" "bucket" {
        id                          = "de-challengue-test-metascore-lnd"
      + labels                      = {}
        name                        = "de-challengue-test-metascore-lnd"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Gustavo.Aguilar0@walmart.com"] has changed
  ~ resource "google_storage_bucket_iam_member" "members" {
      ~ etag   = "CAU=" -> "CAY="
        id     = "b/de-challengue-test-metascore-lnd/roles/storage.objectAdmin/user:gustavo.aguilar0@walmart.com"
        # (3 unchanged attributes hidden)
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Mariano.Gonzalez0@walmart.com"] has changed
  ~ resource "google_storage_bucket_iam_member" "members" {
      ~ etag   = "CAU=" -> "CAY="
        id     = "b/de-challengue-test-metascore-lnd/roles/storage.objectAdmin/user:mariano.gonzalez0@walmart.com"
        # (3 unchanged attributes hidden)
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"] has changed
  ~ resource "google_storage_bucket_iam_member" "members" {
      ~ etag   = "CAU=" -> "CAY="
        id     = "b/de-challengue-test-metascore-lnd/roles/storage.objectAdmin/user:zahidale.zg@gmail.com"
        # (3 unchanged attributes hidden)
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"] has changed
  ~ resource "google_storage_bucket_iam_member" "members" {
      ~ etag   = "CAQ=" -> "CAY="
        id     = "b/de-challengue-test-metascore-lnd/roles/storage.objectViewer/user:zahid.galea@wom.cl"
        # (3 unchanged attributes hidden)
    }

  # module.raw-bucket-metascore.google_storage_bucket.bucket has changed
  ~ resource "google_storage_bucket" "bucket" {
        id                          = "de-challengue-test-metascore-raw"
      + labels                      = {}
        name                        = "de-challengue-test-metascore-raw"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"] has changed
  ~ resource "google_storage_bucket_iam_member" "members" {
      ~ etag   = "CAI=" -> "CAU="
        id     = "b/de-challengue-test-metascore-raw/roles/storage.objectAdmin/user:zahidale.zg@gmail.com"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_project_service.project["workflows.googleapis.com"] will be created
  + resource "google_project_service" "project" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "de-challengue-test"
      + service                    = "workflows.googleapis.com"

      + timeouts {
          + create = "30m"
          + update = "40m"
        }
    }

  # google_pubsub_topic.ldn_arrive_topic must be replaced
-/+ resource "google_pubsub_topic" "ldn_arrive_topic" {
      ~ id      = "projects/de-challengue-test/topics/metascore-lnd-notification" -> (known after apply)
      - labels  = {} -> null
      ~ name    = "metascore-lnd-notification" -> "lnd-notification" # forces replacement
        # (1 unchanged attribute hidden)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # google_pubsub_topic_iam_binding.ldn_arrive_binding must be replaced
-/+ resource "google_pubsub_topic_iam_binding" "ldn_arrive_binding" {
      ~ etag    = "BwXUOUC3aDk=" -> (known after apply)
      ~ id      = "projects/de-challengue-test/topics/metascore-lnd-notification/roles/pubsub.publisher" -> (known after apply)
      ~ project = "de-challengue-test" -> (known after apply)
      ~ topic   = "projects/de-challengue-test/topics/metascore-lnd-notification" -> "lnd-notification" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_storage_notification.object_landing_notification must be replaced
-/+ resource "google_storage_notification" "object_landing_notification" {
      - custom_attributes = {} -> null
      ~ id                = "de-challengue-test-metascore-lnd/notificationConfigs/5" -> (known after apply)
      ~ notification_id   = "5" -> (known after apply)
      ~ self_link         = "https://www.googleapis.com/storage/v1/b/de-challengue-test-metascore-lnd/notificationConfigs/5" -> (known after apply)
      ~ topic             = "//pubsub.googleapis.com/projects/de-challengue-test/topics/metascore-lnd-notification" -> "lnd-notification" # forces replacement
        # (3 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ZahidGalea, Action: `pull_request`, Working Directory: `infraestructure/terraform/de-challenge-test`, Workflow: `Terraform Planning`*